Repository: justinrow-art/quota-harbor
Catalog: CodexQuotaMonitor/Resources/Localizable.xcstrings
Source language: zh_hant
Languages: de, en, es, fr, ja, ko, zh_hans

# settings.claude_relay.state.manual_recovery
source: 需要手動復原。請保留復原檔案與備份，且不要公開備份內容。App 不會自動覆寫 Claude 設定；請依支援文件的手動復原流程處理。
de: Eine manuelle Wiederherstellung ist erforderlich. Bewahren Sie die recovery files und die Sicherung auf und geben Sie deren Inhalt nicht weiter. Die App überschreibt Claude settings nicht automatisch; folgen Sie dem manuellen Wiederherstellungsverfahren in der Support-Dokumentation.
en: Manual recovery is required. Keep the recovery files and backup, and do not share the backup contents. The app will not overwrite Claude settings automatically; follow the support documentation’s manual recovery procedure.
es: Se requiere recuperación manual. Conserva los recovery files y la copia de seguridad, y no compartas su contenido. La app no sobrescribirá automáticamente Claude settings; sigue el procedimiento de recuperación manual de la documentación de soporte.
fr: Une récupération manuelle est requise. Conservez les recovery files et la sauvegarde, et ne partagez pas son contenu. L’app ne remplacera pas automatiquement Claude settings ; suivez la procédure de récupération manuelle de la documentation d’assistance.
ja: 手動復元が必要です。recovery files とバックアップを保持し、バックアップ内容を公開しないでください。アプリは Claude settings を自動で上書きしません。サポート文書の手動復元手順に従ってください。
ko: 수동 복구가 필요합니다. recovery files와 백업을 보관하고 백업 내용을 공개하지 마세요. 앱은 Claude settings를 자동으로 덮어쓰지 않습니다. 지원 문서의 수동 복구 절차를 따르세요.
zh_hans: 需要手动恢复。请保留 recovery files 和备份，且不要公开备份内容。App 不会自动覆盖 Claude settings；请按照支持文档中的手动恢复流程处理。

# settings.claude_relay.state.invalid
source: 設定格式無法安全處理；未進行修改
de: Einstellungen können nicht sicher verarbeitet werden; nichts geändert
en: Settings cannot be handled safely; nothing changed
es: Los ajustes no pueden procesarse con seguridad; no se cambió nada
fr: Les réglages ne peuvent pas être traités en sécurité ; aucune modification
ja: 設定を安全に処理できないため変更していません
ko: 설정을 안전하게 처리할 수 없어 변경하지 않음
zh_hans: 设置格式无法安全处理；未进行修改

# settings.claude_relay.state.failed
source: 讀取或操作失敗；未進行不確定的修改
de: Lesen oder Vorgang fehlgeschlagen; keine unsicheren Änderungen
en: Read or operation failed; no uncertain changes were made
es: Falló la lectura u operación; no se hicieron cambios inciertos
fr: Échec de lecture ou d’opération ; aucune modification incertaine
ja: 読み取りまたは操作に失敗しました。不確かな変更はしていません
ko: 읽기 또는 작업 실패; 불확실한 변경은 하지 않음
zh_hans: 读取或操作失败；未进行不确定的修改

# settings.group.menu_bar
source: 選單列
de: Menüleiste
en: Menu Bar
es: Barra de menús
fr: Barre des menus
ja: メニューバー
ko: 메뉴 막대
zh_hans: 菜单栏

# settings.menu_bar.automatic
source: 自動顯示目前可用窗口
de: Aktuell verfügbare Fenster automatisch anzeigen
en: Automatically show currently available windows
es: Mostrar automáticamente las ventanas disponibles
fr: Afficher automatiquement les fenêtres disponibles
ja: 現在利用可能なウインドウを自動表示
ko: 현재 사용 가능한 기간 자동 표시
zh_hans: 自动显示当前可用窗口

# settings.menu_bar.percentage_display
source: 百分比顯示
de: Prozentanzeige
en: Percentage Display
es: Visualización del porcentaje
fr: Affichage du pourcentage
ja: パーセント表示
ko: 백분율 표시
zh_hans: 百分比显示

# settings.menu_bar.selection_full
source: 已選滿兩個窗口
de: Es sind bereits zwei Fenster ausgewählt
en: Two windows are already selected
es: Ya hay dos ventanas seleccionadas
fr: Deux fenêtres sont déjà sélectionnées
ja: すでに 2 つのウインドウが選択されています
ko: 이미 두 기간이 선택됨
zh_hans: 已选满两个窗口

# settings.menu_bar.selection_limit
source: 最多選擇兩個窗口；請先取消一個已選窗口。
de: Bis zu zwei Fenster auswählen. Vor einer weiteren Auswahl ein Fenster abwählen.
en: Choose up to two windows. Deselect one before choosing another.
es: Elige hasta dos ventanas. Deselecciona una antes de elegir otra.
fr: Choisissez jusqu’à deux fenêtres. Désélectionnez-en une avant d’en choisir une autre.
ja: 選択できるウインドウは 2 つまでです。別のウインドウを選ぶ前に 1 つ解除してください。
ko: 최대 두 기간을 선택할 수 있습니다. 다른 기간을 선택하기 전에 하나를 해제하세요.
zh_hans: 最多选择两个窗口；请先取消一个已选窗口。

# settings.menu_bar.window_retired
source: 目前未提供
de: Derzeit nicht zurückgegeben
en: Currently Not Returned
es: No devuelto actualmente
fr: Actuellement non renvoyé
ja: 現在返されていません
ko: 현재 반환되지 않음

# settings.duration.five_hours
source: 5 小時
de: 5 Stunden
en: 5 hours
es: 5 horas
fr: 5 heures
ja: 5 時間
ko: 5시간
zh_hans: 5 小时

# settings.duration.daily
source: 每日
de: Täglich
en: Daily
es: Diario
fr: Quotidien
ja: 毎日
ko: 매일

# settings.duration.weekly
source: 每週
de: Wöchentlich
en: Weekly
es: Semanal
fr: Hebdomadaire
ja: 毎週
ko: 매주
zh_hans: 每周

# settings.duration.minutes
source: %lld 分鐘
de: %lld Minuten
en: %lld minutes
es: %lld minutos
fr: %lld minutes
ja: %lld 分
ko: %lld분
zh_hans: %lld 分钟

# settings.duration.usage_window
source: 使用窗口
de: Nutzungsfenster
en: Usage Window
es: Ventana de uso
fr: Fenêtre d’utilisation
ja: 使用期間
ko: 사용 기간

# settings.bucket.unnamed
source: 未命名額度桶
de: Unbenannter Bucket
en: Unnamed bucket
es: Bucket sin nombre
fr: Bucket sans nom
ja: 名称のないバケット
ko: 이름 없는 버킷
zh_hans: 未命名 bucket

# settings.group.refresh_source
source: 更新與資料來源
de: Aktualisierung und Datenquelle
en: Refresh and Data Source
es: Actualización y fuente de datos
fr: Actualisation et source des données
ja: 更新とデータソース
ko: 새로 고침 및 데이터 소스
zh_hans: 更新与数据来源

# settings.refresh.schedule_explanation
source: 接收變更通知，並每 5 分鐘自動同步；也可手動重新整理。
de: Empfängt Änderungsmitteilungen und synchronisiert automatisch alle 5 Minuten; eine manuelle Aktualisierung ist ebenfalls möglich.
en: Receives change notifications and syncs automatically every 5 minutes; you can also refresh manually.
es: Recibe notificaciones de cambios y se sincroniza automáticamente cada 5 minutos; también puedes actualizar manualmente.
fr: Reçoit les notifications de modification et se synchronise automatiquement toutes les 5 minutes ; vous pouvez aussi actualiser manuellement.
ja: 変更通知を受信し、5分ごとに自動同期します。手動で更新することもできます。
ko: 변경 알림을 받고 5분마다 자동으로 동기화하며, 수동으로 새로 고칠 수도 있습니다.
zh_hans: 接收变更通知，并每 5 分钟自动同步；也可手动刷新。

# settings.freshness.never_succeeded
source: %@：%@；尚無成功時間
de: %@: %@; noch keine erfolgreiche Aktualisierung
en: %@: %@; no successful update yet
es: %@: %@; aún no hay una actualización correcta
fr: %@ : %@ ; aucune actualisation réussie pour le moment
ja: %@：%@、成功した更新はまだありません
ko: %@: %@; 아직 성공한 업데이트 없음
zh_hans: %@：%@；尚无成功时间

# settings.freshness.last_succeeded
source: %@：%@；上次成功 %@
de: %@: %@; letzte erfolgreiche Aktualisierung %@
en: %@: %@; last successful update %@
es: %@: %@; última actualización correcta %@
fr: %@ : %@ ; dernière actualisation réussie %@
ja: %@：%@、最後に成功した更新 %@
ko: %@: %@; 마지막 성공 업데이트 %@

# settings.source.local_app_server
source: 資料來源：本機已驗證的 Codex app-server
de: Quelle: lokal überprüfter Codex app-server
en: Source: locally verified Codex app-server
es: Fuente: app-server de Codex verificado localmente
fr: Source : app-server Codex vérifié localement
ja: ソース：ローカルで検証済みの Codex app-server
ko: 소스: 로컬에서 검증된 Codex app-server
zh_hans: 数据来源：本机已验证的 Codex app-server

# settings.group.display_location
source: 顯示位置
de: Anzeigeposition
en: Display Location
es: Ubicación de visualización
fr: Emplacement d’affichage
ja: 表示場所
ko: 표시 위치
zh_hans: 显示位置

# settings.display.floating_card
source: 浮動卡片
de: Schwebende Karte
en: Floating Card
es: Tarjeta flotante
fr: Carte flottante
ja: フローティングカード
ko: 플로팅 카드
zh_hans: 浮动卡片

# settings.display.current_space
source: 只跟隨目前 Space
de: Aktuellem Space folgen
en: Follow Current Space
es: Seguir el Space actual
fr: Suivre le Space actuel
ja: 現在の操作スペースのみ
ko: 현재 Space만 따라가기
zh_hans: 仅跟随当前 Space

# settings.display.all_spaces
source: 顯示於所有 Spaces
de: Auf allen Spaces anzeigen
en: Show on All Spaces
es: Mostrar en todos los Spaces
fr: Afficher sur tous les Spaces
ja: すべての操作スペースに表示
ko: 모든 Space에 표시
zh_hans: 显示于所有 Spaces

# settings.group.login
source: 登入時啟動
de: Bei Anmeldung öffnen
en: Open at Login
es: Abrir al iniciar sesión
fr: Ouvrir à la connexion
ja: ログイン時に開く
ko: 로그인 시 열기
zh_hans: 登录时启动

# settings.login.reading
source: 正在讀取
de: Status wird geprüft
en: Checking status
es: Comprobando estado
fr: Vérification de l’état
ja: 状態を確認中
ko: 상태 확인 중
zh_hans: 正在读取

# settings.login.enabled
source: 已啟用
de: Aktiviert
en: Enabled
es: Activado
fr: Activé
ja: 有効
ko: 활성화됨
zh_hans: 已启用

# settings.login.disabled
source: 未啟用
de: Nicht aktiviert
en: Not Enabled
es: No activado
fr: Non activé
ja: 無効
ko: 비활성화됨
zh_hans: 未启用

# settings.login.requires_approval
source: 需要在系統設定的登入項目中允許
de: Dieses Anmeldeobjekt in den Systemeinstellungen erlauben
en: Allow this login item in System Settings
es: Permite este ítem de inicio en Ajustes del Sistema
fr: Autorisez cet élément d’ouverture dans Réglages Système
ja: システム設定でこのログイン項目を許可してください
ko: 시스템 설정에서 이 로그인 항목을 허용하세요
zh_hans: 需要在系统设置的登录项中允许

# settings.login.unavailable
source: 目前版本無法建立登入項目
de: Diese Version kann kein Anmeldeobjekt erstellen
en: This version cannot create a login item
es: Esta versión no puede crear un ítem de inicio
fr: Cette version ne peut pas créer d’élément d’ouverture
ja: このバージョンではログイン項目を作成できません
ko: 이 버전에서는 로그인 항목을 만들 수 없음
zh_hans: 当前版本无法创建登录项

# settings.group.language
source: 語言
de: Sprache
en: Language
es: Idioma
fr: Langue
ja: 言語
ko: 언어
zh_hans: 语言

# settings.language.interface
source: 介面語言
de: Oberflächensprache
en: Interface Language
es: Idioma de la interfaz
fr: Langue de l’interface
ja: インターフェイスの言語
ko: 인터페이스 언어
zh_hans: 界面语言

# language.system
source: 跟隨系統
de: Systemeinstellung
en: Follow System
es: Seguir el sistema
fr: Selon le système
ja: システムに従う
ko: 시스템 설정 따르기
zh_hans: 跟随系统

# language.zh_hant
source: 繁體中文
de: Traditionelles Chinesisch
es: Chino tradicional
fr: Chinois traditionnel
ja: 繁體字中国語
ko: 중국어 번체

# language.zh_hans
source: 简体中文
de: Vereinfachtes Chinesisch
es: Chino simplificado
fr: Chinois simplifié
ja: 簡体字中国語
ko: 중국어 간체

# language.en
source: English
de: Englisch
es: Inglés
fr: Anglais
ja: 英語
ko: 영어

# language.ja
source: 日本語
de: Japanisch
es: Japonés
fr: Japonais
ko: 일본어

# language.ko
source: 한국어
de: Koreanisch
es: Coreano
fr: Coréen
ja: 韓国語

# language.es
source: Español
de: Spanisch
fr: Espagnol
ja: スペイン語
ko: 스페인어

# language.fr
source: Français
de: Französisch
es: Francés
ja: フランス語
ko: 프랑스어

# settings.group.theme
source: 主題
de: Theme
en: Theme
es: Tema
fr: Thème
ja: テーマ
ko: 테마
zh_hans: 主题

# settings.theme.custom
source: 自訂主題…
de: Eigenes Theme…
en: Custom Theme…
es: Tema personalizado…
fr: Thème personnalisé…
ja: カスタムテーマ…
ko: 사용자 지정 테마…
zh_hans: 自定义主题…

# settings.theme.engine_pending
source: 主題引擎完成後即可切換；目前不會假裝套用。
de: Der Wechsel ist verfügbar, sobald die Theme-Engine bereit ist; derzeit wird kein Theme simuliert.
en: Theme switching will be available when the theme engine is ready; no theme is being simulated.
es: El cambio estará disponible cuando el motor de temas esté listo; ahora no se simula ningún tema.
fr: Le changement sera disponible lorsque le moteur de thèmes sera prêt ; aucun thème n’est simulé.
ja: テーマエンジンの準備ができると切り替えられます。現在は適用を装いません。
ko: 테마 엔진이 준비되면 전환할 수 있으며 현재는 적용된 것처럼 표시하지 않습니다.
zh_hans: 主题引擎完成后即可切换；当前不会假装应用。

# settings.theme.open_editor
source: 開啟進階自訂主題編輯器…
de: Erweiterten Editor für eigene Themes öffnen…
en: Open Advanced Custom Theme Editor…
es: Abrir editor avanzado de temas personalizados…
fr: Ouvrir l’éditeur avancé de thème personnalisé…
ja: 高度なカスタムテーマエディタを開く…
ko: 고급 사용자 지정 테마 편집기 열기…
zh_hans: 打开高级自定义主题编辑器…

# settings.group.appearance_mode
source: 外觀模式
de: Erscheinungsmodus
en: Appearance Mode
es: Modo de apariencia
fr: Mode d’apparence
ja: 外観モード
ko: 모양 모드
zh_hans: 外观模式

# settings.appearance.color_scheme
source: 明暗模式
de: Hell-/Dunkelmodus
en: Light/Dark Mode
es: Modo claro/oscuro
fr: Mode clair/sombre
ja: ライト／ダークモード
ko: 라이트/다크 모드

# settings.appearance.light
source: 淺色
de: Hell
en: Light
es: Claro
fr: Clair
ja: ライト
ko: 라이트
zh_hans: 浅色

# settings.appearance.dark
source: 深色
de: Dunkel
en: Dark
es: Oscuro
fr: Sombre
ja: ダーク
ko: 다크

# settings.appearance.density
source: 資訊密度
de: Informationsdichte
en: Information Density
es: Densidad de información
fr: Densité d’information
ja: 情報密度
ko: 정보 밀도
zh_hans: 信息密度

# settings.appearance.comfortable
source: 舒適
de: Komfortabel
en: Comfortable
es: Cómoda
fr: Confortable
ja: ゆったり
ko: 편안하게
zh_hans: 舒适

# settings.appearance.compact
source: 精簡
de: Kompakt
en: Compact
es: Compacta
fr: Compacte
ja: コンパクト
ko: 간결하게
zh_hans: 紧凑

# settings.appearance.display_profile
source: 卡片詳細程度
de: Kartendetails
en: Card Details
es: Detalle de la tarjeta
fr: Détails de la carte
ja: カードの詳細度
ko: 카드 상세 수준
zh_hans: 卡片详细程度

# settings.display_profile.compact
source: 精簡
de: Kompakt
en: Compact
es: Compacto
fr: Compact
ja: コンパクト
ko: 간단히
zh_hans: 精简

# settings.display_profile.balanced
source: 平衡
de: Ausgewogen
en: Balanced
es: Equilibrado
fr: Équilibré
ja: バランス
ko: 균형
zh_hans: 均衡

# settings.display_profile.full
source: 完整
de: Vollständig
en: Full
es: Completo
fr: Complet
ja: フル
ko: 전체

# settings.group.accessibility_preview
source: 輔助使用預覽
de: Bedienungshilfen-Vorschau
en: Accessibility Preview
es: Vista previa de accesibilidad
fr: Aperçu de l’accessibilité
ja: アクセシビリティのプレビュー
ko: 손쉬운 사용 미리보기
zh_hans: 辅助功能预览

# settings.group.capabilities
source: 協定能力
de: Protokollfunktionen
en: Protocol Capabilities
es: Capacidades del protocolo
fr: Capacités du protocole
ja: プロトコル機能
ko: 프로토콜 기능
zh_hans: 协议能力

# settings.capability.rate_limits
source: 額度限制
de: Kontingentlimits
en: Quota Limits
es: Límites de cuota
fr: Limites du quota
ja: 使用量制限
ko: 할당량 제한
zh_hans: 额度限制

# settings.capability.token_activity
source: Token 活動
de: Token-Aktivität
en: Token Activity
es: Actividad de tokens
fr: Activité des jetons
ja: トークンアクティビティ
ko: 토큰 활동
zh_hans: Token 活动

# settings.capability.stale
source: 資料可能已過期
de: Daten könnten veraltet sein
en: Data may be stale
es: Los datos pueden estar desactualizados
fr: Les données peuvent être périmées
ja: データが古い可能性があります
ko: 데이터가 오래되었을 수 있음
zh_hans: 数据可能已过期

# settings.capability.not_provided
source: 目前 Codex 版本未提供
de: Von dieser Codex-Version nicht bereitgestellt
en: Not provided by this Codex version
es: Esta versión de Codex no lo proporciona
fr: Non fourni par cette version de Codex
ja: 現在の Codex バージョンでは提供されません
ko: 현재 Codex 버전에서 제공하지 않음
zh_hans: 当前 Codex 版本未提供

# settings.codex.installed_version
source: 已安裝 Codex 版本
de: Installierte Codex-Version
en: Installed Codex Version
es: Versión instalada de Codex
fr: Version installée de Codex
ja: インストール済み Codex バージョン
ko: 설치된 Codex 버전
zh_hans: 已安装 Codex 版本

# settings.group.redacted_diagnostics
source: 已去識別診斷
de: Anonymisierte Diagnose
en: De-identified Diagnostics
es: Diagnóstico anonimizado
fr: Diagnostic anonymisé
ja: 匿名化された診断情報
ko: 비식별화 진단
zh_hans: 去标识化诊断

# settings.group.reset_theme_files
source: 重設與主題檔
de: Zurücksetzen und Theme-Dateien
en: Reset and Theme Files
es: Restablecer y archivos de tema
fr: Réinitialisation et fichiers de thème
ja: リセットとテーマファイル
ko: 재설정 및 테마 파일
zh_hans: 重置与主题文件

# theme.builtin.morandi
source: 莫蘭迪
de: Morandi
en: Morandi
es: Morandi
fr: Morandi
ja: モランディ
ko: 모란디
zh_hans: 莫兰迪

# theme.builtin.cyberpunk
source: 賽博龐克
de: Cyberpunk
en: Cyberpunk
es: Ciberpunk
fr: Cyberpunk
ja: サイバーパンク
ko: 사이버펑크
zh_hans: 赛博朋克

# theme.builtin.warm_hand_drawn
source: 溫暖手繪動畫
de: Warme handgezeichnete Animation
en: Warm Hand-Drawn Animation
es: Animación cálida dibujada a mano
fr: Animation chaleureuse dessinée à la main
ja: 温かい手描きアニメーション
ko: 따뜻한 손그림 애니메이션
zh_hans: 温暖手绘动画

# theme.builtin.glass
source: 玻璃感
de: Glas
en: Glass
es: Cristal
fr: Verre
ja: ガラス
ko: 유리
zh_hans: 玻璃质感

# theme.builtin.sketch
source: 素描
de: Skizze
en: Sketch
es: Boceto
fr: Croquis
ja: スケッチ
ko: 스케치

# theme.builtin.cartoon_illustration
source: 卡通插畫
de: Cartoon-Illustration
en: Cartoon Illustration
es: Ilustración de dibujos animados
fr: Illustration cartoon
ja: カートゥーンイラスト
ko: 카툰 일러스트
zh_hans: 卡通插画

# theme.state.availability.loading
source: 載入中
de: Wird geladen
en: Loading
es: Cargando
fr: Chargement
ja: 読み込み中
ko: 불러오는 중
zh_hans: 加载中

# theme.state.availability.fresh
source: 最新
de: Aktuell
en: Fresh
es: Actualizado
fr: À jour
ko: 최신

# theme.state.availability.partial
source: 部分資料
de: Teilweise
en: Partial
es: Parcial
fr: Partiel
ja: 一部
ko: 일부
zh_hans: 部分数据

# theme.state.availability.stale
source: 已過期
de: Veraltet
en: Stale
es: Desactualizado
fr: Périmé
ja: 期限切れ
ko: 오래됨
zh_hans: 已过期

# theme.state.availability.unsupported
source: 不支援
de: Nicht unterstützt
en: Unsupported
es: No compatible
fr: Non pris en charge
ja: 未対応
ko: 지원되지 않음
zh_hans: 不支持

# theme.state.availability.unavailable
source: 無法取得
de: Nicht verfügbar
en: Unavailable
es: No disponible
fr: Indisponible
ja: 取得できません
ko: 사용할 수 없음
zh_hans: 无法获取

# theme.state.health.healthy
source: 額度充足
de: Kontingent ausreichend
en: Quota Healthy
es: Cuota suficiente
fr: Quota suffisant
ja: 使用量に余裕あり
ko: 할당량 충분
zh_hans: 额度充足

# theme.state.health.warning
source: 額度偏低
de: Kontingent niedrig
en: Quota Low
es: Cuota baja
fr: Quota faible
ja: 残りわずか
ko: 할당량 낮음
zh_hans: 额度偏低

# theme.state.health.critical
source: 額度即將用完
de: Kontingent fast aufgebraucht
en: Quota Nearly Used Up
es: Cuota casi agotada
fr: Quota presque épuisé
ja: まもなく上限
ko: 할당량 거의 소진
zh_hans: 额度即将用完

# theme.editor.title
source: 主題草稿
de: Theme-Entwurf
en: Theme Draft
es: Borrador de tema
fr: Brouillon de thème
ja: テーマの下書き
ko: 테마 초안
zh_hans: 主题草稿

# theme.editor.name
source: 主題名稱
de: Theme-Name
en: Theme Name
es: Nombre del tema
fr: Nom du thème
ja: テーマ名
ko: 테마 이름
zh_hans: 主题名称

# theme.editor.duplicate_name
source: 副本名稱
de: Name der Kopie
en: Copy Name
es: Nombre de la copia
fr: Nom de la copie
ja: コピー名
ko: 복사본 이름
zh_hans: 副本名称

# theme.editor.duplicate_default_name
source: %@ 副本
de: %@ – Kopie
en: %@ Copy
es: Copia de %@
fr: Copie de %@
ja: %@ のコピー
ko: %@ 복사본

# theme.editor.duplicate_builtin
source: 複製內建主題
de: Integriertes Theme duplizieren
en: Duplicate Built-in Theme
es: Duplicar tema integrado
fr: Dupliquer le thème intégré
ja: 内蔵テーマを複製
ko: 내장 테마 복제
zh_hans: 复制内置主题

# theme.editor.appearance
source: 編輯外觀
de: Erscheinungsbild bearbeiten
en: Edit Appearance
es: Editar apariencia
fr: Modifier l’apparence
ja: 編集する外観
ko: 편집 모양
zh_hans: 编辑外观

# theme.editor.background
source: 背景
de: Hintergrund
en: Background
es: Fondo
fr: Arrière-plan
ko: 배경

# theme.editor.background_type
source: 背景類型
de: Hintergrundtyp
en: Background Type
es: Tipo de fondo
fr: Type d’arrière-plan
ja: 背景タイプ
ko: 배경 유형
zh_hans: 背景类型

# theme.editor.background.solid
source: 純色
de: Volltonfarbe
en: Solid Color
es: Color sólido
fr: Couleur unie
ja: 単色
ko: 단색
zh_hans: 纯色

# theme.editor.background.gradient
source: 漸層（2–4 色）
de: Verlauf (2–4 Farben)
en: Gradient (2–4 colors)
es: Degradado (2–4 colores)
fr: Dégradé (2 à 4 couleurs)
ja: グラデーション（2〜4 色）
ko: 그라디언트(2~4색)
zh_hans: 渐变（2–4 色）

# theme.editor.background.system_material
source: 系統材質
de: Systemmaterial
en: System Material
es: Material del sistema
fr: Matériau système
ja: システムマテリアル
ko: 시스템 재질
zh_hans: 系统材质

# theme.editor.semantic_colors
source: 語意色彩
de: Semantische Farben
en: Semantic Colors
es: Colores semánticos
fr: Couleurs sémantiques
ja: セマンティックカラー
ko: 의미 색상
zh_hans: 语义色彩

# theme.editor.geometry
source: 形狀與透明度
de: Form und Transparenz
en: Shape and Transparency
es: Forma y transparencia
fr: Forme et transparence
ja: 形状と透明度
ko: 모양 및 투명도
zh_hans: 形状与透明度

# theme.editor.raster
source: 裝飾圖片
de: Dekoratives Bild
en: Decorative Image
es: Imagen decorativa
fr: Image décorative
ja: 装飾画像
ko: 장식 이미지
zh_hans: 装饰图片

# theme.editor.raster.none
source: 未使用圖片
de: Kein Bild verwendet
en: No image is in use
es: No se usa ninguna imagen
fr: Aucune image utilisée
ja: 画像は使用されていません
ko: 사용 중인 이미지 없음
zh_hans: 未使用图片

# theme.editor.raster.sanitized
source: 已選擇並安全處理圖片
de: Bild ausgewählt und sicher verarbeitet
en: Image selected and safely processed
es: Imagen seleccionada y procesada de forma segura
fr: Image sélectionnée et traitée de façon sûre
ja: 画像を選択し、安全に処理しました
ko: 이미지 선택 및 안전 처리 완료
zh_hans: 已选择并安全处理图片

# theme.editor.raster.policy
source: 只接受經過驗證及重新編碼的 PNG／JPEG。
de: Nur geprüfte und neu codierte PNG- oder JPEG-Bilder werden akzeptiert.
en: Only validated and re-encoded PNG or JPEG images are accepted.
es: Solo se aceptan imágenes PNG o JPEG validadas y recodificadas.
fr: Seules les images PNG ou JPEG validées et réencodées sont acceptées.
ja: 検証して再エンコードされた PNG または JPEG のみ受け付けます。
ko: 검증 및 재인코딩된 PNG 또는 JPEG만 허용됩니다.
zh_hans: 仅接受经过验证并重新编码的 PNG/JPEG。

# theme.editor.transfer
source: 匯入、匯出與重設
de: Importieren, exportieren und zurücksetzen
en: Import, Export, and Reset
es: Importar, exportar y restablecer
fr: Importation, exportation et réinitialisation
ja: 読み込み、書き出し、リセット
ko: 가져오기, 내보내기 및 재설정
zh_hans: 导入、导出与重置

# theme.editor.include_raster
source: 匯出時包含已安全處理的圖片
de: Sicher verarbeitetes Bild beim Exportieren einschließen
en: Include the safely processed image when exporting
es: Incluir la imagen procesada de forma segura al exportar
fr: Inclure l’image traitée de façon sûre lors de l’exportation
ja: 書き出し時に安全に処理済みの画像を含める
ko: 내보낼 때 안전 처리된 이미지 포함
zh_hans: 导出时包含已安全处理的图片

# theme.editor.preview
source: 即時預覽
de: Live-Vorschau
en: Live Preview
es: Vista previa en vivo
fr: Aperçu en direct
ja: ライブプレビュー
ko: 실시간 미리보기
zh_hans: 实时预览

# theme.editor.data_state
source: 資料狀態
de: Datenstatus
en: Data State
es: Estado de los datos
fr: État des données
ja: データ状態
ko: 데이터 상태
zh_hans: 数据状态

# theme.editor.safe_to_save
source: 主題可以安全儲存。
de: Das Theme kann sicher gesichert werden.
en: The theme can be saved safely.
es: El tema se puede guardar de forma segura.
fr: Le thème peut être enregistré en toute sécurité.
ja: テーマは安全に保存できます。
ko: 테마를 안전하게 저장할 수 있습니다.
zh_hans: 主题可以安全保存。

# theme.editor.error.invalid_name
source: 主題名稱不可空白。請輸入名稱後再儲存。
de: Der Theme-Name darf nicht leer sein. Vor dem Sichern einen Namen eingeben.
en: The theme name cannot be blank. Enter a name before saving.
es: El nombre del tema no puede estar vacío. Escribe un nombre antes de guardar.
fr: Le nom du thème ne peut pas être vide. Saisissez un nom avant d’enregistrer.
ja: テーマ名を空欄にはできません。保存前に名前を入力してください。
ko: 테마 이름은 비워 둘 수 없습니다. 저장하기 전에 이름을 입력하세요.
zh_hans: 主题名称不能为空。请输入名称后再保存。

# theme.editor.error.invalid_range
source: %@ 必須介於 %@ 與 %@ 之間。請調整後再儲存。
de: %@ muss zwischen %@ und %@ liegen. Vor dem Sichern anpassen.
en: %@ must be between %@ and %@. Adjust it before saving.
es: %@ debe estar entre %@ y %@. Ajústalo antes de guardar.
fr: %@ doit être compris entre %@ et %@. Ajustez avant d’enregistrer.
ja: %@ は %@ から %@ の範囲にしてください。保存前に調整してください。
ko: %@ 값은 %@에서 %@ 사이여야 합니다. 저장하기 전에 조정하세요.
zh_hans: %@ 必须介于 %@ 和 %@ 之间。请调整后再保存。

# theme.editor.error.invalid_contrast
source: %@ 與 %@ 對比不足。請提高明暗差異後再儲存。
de: %@ hat nicht genügend Kontrast zu %@. Den Unterschied vor dem Sichern erhöhen.
en: %@ does not have enough contrast against %@. Increase the difference before saving.
es: %@ no tiene suficiente contraste con %@. Aumenta la diferencia antes de guardar.
fr: %@ n’a pas assez de contraste avec %@. Augmentez la différence avant d’enregistrer.
ja: %@ は %@ とのコントラストが不足しています。保存前に差を大きくしてください。
ko: %@은(는) %@에 대한 대비가 부족합니다. 저장하기 전에 차이를 높이세요.
zh_hans: %@ 与 %@ 对比不足。请提高明暗差异后再保存。

# theme.editor.error.invalid_color
source: %@ 外觀的 %@ 色彩格式無效。請輸入 #RRGGBB 或 #RRGGBBAA。
de: Die Darstellung %@ hat eine ungültige Farbe für %@. #RRGGBB oder #RRGGBBAA eingeben.
en: The %@ appearance has an invalid %@ color. Enter #RRGGBB or #RRGGBBAA.
es: La apariencia %@ tiene un color %@ no válido. Escribe #RRGGBB o #RRGGBBAA.
fr: L’apparence %@ comporte une couleur %@ incorrecte. Saisissez #RRGGBB ou #RRGGBBAA.
ja: %@ 外観の %@ の色形式が無効です。#RRGGBB または #RRGGBBAA を入力してください。
ko: %@ 모드의 %@ 색상 형식이 잘못되었습니다. #RRGGBB 또는 #RRGGBBAA를 입력하세요.
zh_hans: %@ 外观的 %@ 颜色格式无效。请输入 #RRGGBB 或 #RRGGBBAA。
